 ![png](image_books_erd.png)

# Imports

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

# Examine and Preprocess Data

In [4]:
 # Read in the given files for comparison
users = pd.read_csv('Data/users.csv')
books = pd.read_csv('Data/books.csv')
authors = pd.read_csv('Data/authors.csv')
favorites = pd.read_csv('Data/favorites.csv')

## Books

In [5]:
q= '''SELECT * FROM books'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, title, author_id]
Index: []

In [6]:
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [7]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

       Field         Type Null  Key Default Extra
0         id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int   NO         None

In [8]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'title', 'author_id'], dtype=object)

In [9]:
books.dtypes

id            int64
title        object
author_id     int64
dtype: object

### Foreign Key Check

In [10]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, engine)

   @@FOREIGN_KEY_CHECKS
0                     1

In [11]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
engine.execute(q)

In [12]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, engine)

   @@FOREIGN_KEY_CHECKS
0                     0

### Insert values (books)

In [13]:
#inserting data
books.to_sql("books",conn,index=False, if_exists='append')

6

In [14]:
# confirm the data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

# # Users

In [15]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [16]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'first_name', 'last_name', 'email'], dtype=object)

In [17]:
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [18]:
users.dtypes

id             int64
first_name    object
last_name     object
email         object
dtype: object

### Insert values (users)

In [19]:
users.to_sql("users",conn,index=False, if_exists='append')

3

In [20]:
q = """SELECT * FROM users;"""
pd.read_sql(q,conn)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

# #Authors

In [21]:
authors = pd.read_csv('data/authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [22]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [23]:
describe['Field'].values

array(['id', 'author_name'], dtype=object)

In [24]:
authors.dtypes

id              int64
author_name    object
dtype: object

### Insert values (authors)

In [25]:
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [26]:
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

# Favorites

In [27]:
favorites = pd.read_csv('data/favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [28]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

     Field Type Null  Key Default Extra
0  book_id  int   NO  PRI    None
1  user_id  int   NO  PRI    None

In [29]:
describe['Field'].values

array(['book_id', 'user_id'], dtype=object)

In [30]:
favorites.dtypes

user_id    int64
book_id    int64
dtype: object

### Insert values (favorites)

In [31]:
favorites.to_sql('favorites', conn, index=False, if_exists='append')

7

# Testing the DataBase

In [32]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [34]:

q = """
SELECT books.title, favorites.user_id 
FROM books 
JOIN favorites ON books.id = favorites.book_id 
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q,conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1